app/views/users/index.html.erb

<% User.all.each do |user| %>
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC