app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 36]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
---
        <div class='col-md-4 d-flex gap-2'>
          <p class="card-text">Comments: <%= @post.comments.size %></p>
          <p class="card-text">Likes: <%= @post.likes.size %></p>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 36]]
---
      <div class="card-body">
        <% @post.comments.each do |comment|%>