app/models/comment.rb

  def update_comments_counter
    post.update(comments_counter: post.comments.size)
---
UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) + $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 1]]