app/models/like.rb

  def update_likes_counter
    post.update(likes_counter: post.likes.all.length)
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 1], ["updated_at", "2022-12-10 18:56:11.393726"], ["id", 1]]